<?php

namespace App\Models;

use Illuminate\Database\Eloquent\Model;

class CategorySong extends Model
{
    protected $table = 'categorySong';
    protected $fillabre = ['title'];

    /**-------------------------------------------------------------
     * Роблю звязок між таблицею пісень
     * ----------------------------------------------------------------**/
    public function song()
    {
        return $this->hasMany('App\Models\Song');
    }
    /**-------------------------------------------------------------
     * Кінець
     * ----------------------------------------------------------------**/
    /**-------------------------------------------------------------
     * Витягую всі категорії з лімітом 30
     * ----------------------------------------------------------------**/
    public function getActive()
    {
        return $this->published()->orderBy('title', 'asc')->get();
    }
    /**-------------------------------------------------------------
     * Кінець
     * ----------------------------------------------------------------**/
    /**-------------------------------------------------------------
     * Передаю дані для сортування і сортую список категорій
     * ----------------------------------------------------------------**/
    public function sortCategory($sort, $sortBy)
    {
        return $this->published()->orderBy($sort, $sortBy)->get();

    }
    /**-------------------------------------------------------------
     * Кінець
     * ----------------------------------------------------------------**/
    /**-------------------------------------------------------------
     * Витягую одну категорію з певним заголовком
     * ----------------------------------------------------------------**/
    public function getId($title_eng)
    {
        return $this->where(['title_eng' => $title_eng])->firstOrFail();
    }
    /**-------------------------------------------------------------
     * Кінець
     * ----------------------------------------------------------------**/
    /**-------------------------------------------------------------
     * Витягую одну категорію
     * ----------------------------------------------------------------**/
    public function oneCategory($id)
    {
        return $this->where(['id' => $id])->firstOrFail();
    }

    /**-------------------------------------------------------------
     * Кінець
     * ----------------------------------------------------------------**/
    /**-------------------------------------------------------------
     * Витягую категорії які найбільш переглядають
     * ----------------------------------------------------------------**/
        public function most_popular()
    {
        return $this->published()->orderBy('count_views_cat', 'desc')->take(3)->get();

    }
    /**-------------------------------------------------------------
     * Кінець
     * ----------------------------------------------------------------**/
    /**-------------------------------------------------------------
     * Витягую категорії які були додані остані
     * ----------------------------------------------------------------**/
    public function last_add()
    {
        return $this->published()->orderBy('created_at', 'desc')->take(3)->get();

    }
    /**-------------------------------------------------------------
     * Кінець
     * ----------------------------------------------------------------**/
    public function scopePublished($query)
    {

        $query->where(['active' => 1]);

    }

}
